import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","npcID","npc2ID","talkCD","text1","text2","talkOrder"],["","","","","","",""],[1,3,2,3,["同学你怎么不去上课？","那你来这里干什么？","什么新世界？","夜晚？这里不需要值夜班，我还没见过学校的夜晚。","如果有机会的话，我会的，我继续去巡逻了。","嗯，你也快离开吧！"],["我不是这里的学生。","来这里探索新世界","这是个魔法世界，你不好奇夜晚发生的事吗？","也许你可以留下来看看校园的黑夜。","好的，校警大叔再见！"],0],[2,3,10,3,["下一节课是体育课吗？","我以前也是田径队的呢。","听说夜晚有奇怪的事？","那可能是学生编造的吧。","哈哈哈也是，我先去巡逻了！"],["是的。","看你体格确实不错！","我在这里工作了好几年，还没听说过。","很有可能，毕竟哪个学校又没有传说呢？","好的，下次再聊！"],0],[3,12,4,3,["最近在看什么书呢？","魔法？我从来不相信有魔法！只有知识才是探索世界的关键","哼！愚昧！"],["《哈利波特》一本关于友情和魔法冒险的书。","但是看看课外书也没有什么问题啊？说不定真的有魔法呢！"],0],[4,12,2,3,["你每天到底在研究什么？","曾经我们一起学习的时光我看你是全都忘记了！","没有你这第一少了很多乐趣，你到底为什么不想学了？","魔法魔法，整天都是魔法！魔法让我失去了你！我狠魔法！"],["不用你管！","你现在一直是全校第一不开心吗？","我好像发现了魔法，一种别人无法理解的东西"],0],[5,12,21,3,["老师！这次的作业我也提前完成了！","老师这是我作为一名学生应该做的。","我会监督大家学习的老师！"],["太棒了！你真是老师的骄傲！","每次你提前完成和复习，如果同学们都像你这样就好了!"],0],[6,27,28,30,["终于放假了！我好像回家吃点好吃的啊！","回去我要好好洗个澡！","列车快来吧！"],["就是就是！我的头发都臭臭的了。","我也是我要好好打理我的头发","快来吧！"],0]];
export interface INPCChatElement extends IElementBase{
 	/**qid*/
	ID:number
	/**对话npc1ID*/
	npcID:number
	/**对话npc2ID*/
	npc2ID:number
	/**对话CD*/
	talkCD:number
	/**npc1对话聊天*/
	text1:Array<string>
	/**npc2对话聊天*/
	text2:Array<string>
	/**对话顺序（0先说；1后说）*/
	talkOrder:number
 } 
export class NPCChatConfig extends ConfigBase<INPCChatElement>{
	constructor(){
		super(EXCELDATA);
	}

}