import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","goodID","Name","currency","money","sort","limitCount","isNew","refreshDay"],["","","","","","","","",""],[1,150001,"黄鸭子泳圈",1,1,1,0,0,0],[2,150002,"绿鸭子泳圈",1,1,2,0,0,0],[3,150003,"紫鸭子泳圈",1,1,3,0,0,0],[4,150004,"粉鸭子泳圈",1,1,4,0,0,0],[5,150005,"小黄鸭泳圈",1,1,5,0,0,0],[6,150006,"海滩躺椅",1,1,6,0,0,0],[7,150007,"椅子",1,1,7,0,0,0],[8,150008,"烤乳猪",1,1,8,0,0,0],[9,150009,"花瓶",1,1,9,0,0,0],[10,150010,"冰淇淋",1,1,10,0,0,0],[11,150011,"巧克力",1,1,11,0,0,0],[12,150012,"布丁",1,1,12,0,0,0],[13,150013,"姜饼小屋",1,1,13,0,0,0],[14,150014,"XO果汁",1,1,14,0,0,0],[15,150015,"小麦果汁",1,1,15,0,0,0],[16,150016,"大麦果汁",1,1,16,0,0,0],[17,150017,"音响",1,1,17,0,0,0],[18,150018,"垃圾桶",1,1,18,0,0,0],[19,150019,"马桶",1,1,19,0,0,0],[20,150020,"花柱",1,1,20,0,0,0],[21,150021,"灯",1,1,21,0,0,0],[22,150022,"樱花树",1,1,22,0,0,0],[23,150023,"雕像",1,1,23,0,0,0],[24,150024,"沙发",1,1,24,0,0,0],[25,150025,"吧台",1,1,25,0,0,0],[26,150026,"冰箱",1,1,26,0,0,0],[27,150027,"足球",1,3,27,0,0,0],[28,150028,"茄子",1,3,28,0,0,0],[29,150029,"黑脸猫",1,3,29,0,0,0],[30,150030,"奶牛猫",1,3,30,0,0,0],[31,150031,"小花猫",1,3,31,0,0,0],[32,150032,"黑白狗",1,3,32,0,0,0],[33,150033,"小花狗",1,3,33,0,0,0],[34,150034,"小棕狗",1,3,34,0,0,0]];
export interface IShopElement extends IElementBase{
 	/**qid*/
	id:number
	/**背包物品id*/
	goodID:number
	/**商品名称*/
	Name:string
	/**货币类型（1为钞票，2为银币，3月亮币）*/
	currency:number
	/**花费多少钱*/
	money:number
	/**排序参数，数字越小越靠前*/
	sort:number
	/**限购数量（0不限购，大于0为限购几个）*/
	limitCount:number
	/**是否标记新物品*/
	isNew:number
	/**过几天刷新（0为不刷新，大于0为刷新天数，目前只支持1天）*/
	refreshDay:number
 } 
export class ShopConfig extends ConfigBase<IShopElement>{
	constructor(){
		super(EXCELDATA);
	}

}